<template>
  <div class="carousels">
    <el-carousel :interval="4000">
      <el-carousel-item v-for="item in homeData" :key="item.id">
        <HoverCard class="medium" :style="{ backgroundImage: 'url(' + item.img + ')' }" @click="goDetail()">
          <h5 slot="title">{{ item.title }}</h5>
          <h5 slot="info-title">{{ item.title }}</h5>
          <article slot="info-content" v-html="item.content"></article>
          <ClickButton slot="btn" @click.native="goDetail(item)">探索更多</ClickButton>
        </HoverCard>
      </el-carousel-item>
    </el-carousel>
  </div>
</template>
<script>
  import HoverCard from '@/components/HoverCard'
  import ClickButton from '@/components/ClickButton'
  export default {
    name: '',
    components: {
      HoverCard,
      ClickButton,
    },
    data() {
      return {
        homeData: [
          {
            id: 0,
            img: 'https://qucs.oss-cn-hangzhou.aliyuncs.com/images/0.jpg',
            title: '双管齐下韩国加速迈向碳中和',
            content: `<div class="detil-new-cont" id="content">
<p style="text-align: center;"></p><p style="text-align: center;">当地时间2021年10月18日，韩国首尔，韩国总统文在寅出席2050碳中和委员会第二次全体会议并发言。</p><p>　　12月14日，韩国产业通商资源部表示，以韩澳首脑会谈为契机，韩国于13日同澳大利亚签署“关键矿产供应链合作”“碳中和技术落实计划及清洁氢能经济合作”两份谅解备忘录，加强关键矿产供应链和碳中和技术领域合作。这是韩国自2020年10月发表“2050碳中和宣言”以来，在碳中和相关国际合作道路上迈出的又一关键步伐。在走向碳中和的道路上，韩国政府坚持两条腿走路，一方面鼓励企业加快技术革新，给予政策支持，另一方面积极寻求国际合作，以外促内。</p><p>　<strong>　2050碳中和委员会发挥中枢作用</strong></p><p>　　韩国自20世纪70年代开始，经济发展走上快车道，逐渐成为世界重要经济体。但随着经济的高速发展，其能源环保领域面临的压力也越来越大。当前，韩国温室气体排放总量在世界排名第11位，石化和钢铁等制造业比重偏高，煤炭发电比重达到40%。</p><p>　　为解决环保问题，同时利用在氢能源、电池制造等领域已有的技术优势完成新时期经济转型，韩国政府决定主动求变，以碳中和为契机，积极培育数字经济、环保型战略新兴产业。为此，总统直属的“2050碳中和委员会”于2021年5月应运而生。该委员会成员的构成为：国务总理、民间委员78名，中央行政机关高级官员18名。委员会作为碳中和政策的指挥塔，负责碳中和相关政策的审议和执行过程中的监督等。</p><p>　　2021年10月，韩国总统文在寅在2050碳中和委员会第二次全体会议上表示，韩国政府决定将2030国家自主贡献目标（世界各国根据自身情况确定的应对气候变化行动目标）从原先的26.3%上调至40%，并强调这是韩国政府根据当前条件制订的最大目标，以此向国际社会彰显政府实现碳中和的坚定决心。确立此目标，意在促使韩国经济可持续发展并提升国家竞争力，政府将加速减少温室气体排放量。</p><p>　　面对企业忧虑，文在寅总统表示，政府深知产业界和劳动界的担忧，因此将在政策、财政方面提供大力支持，不会加重企业负担。</p><p>　　<strong>对国内企业积极引导</strong></p><p>　　12月10日，韩国政府在总统府邀请碳中和先进企业举行战略报告会，公布了“工业与能源碳中和大转型愿景与战略”。根据该战略，韩国政府树立了成为“引领低碳经济的世界四大工业强国”之一的高目标，为此将在能源供应、流通、消费等全过程实现清洁能源转型。一是政府将加大在氢能、可再生能源、电网等领域的基础设施投资，为无碳电能和清洁氢能的供应打基础；二是到2034年淘汰24座老旧煤炭发电机组，将煤炭发电配额制度向民间领域推广，通过这些努力争取到2050年全面淘汰煤炭发电；三是政府将与公营企业合作扩大对碳中和项目的投资，并带领民间领域增加碳中和投资，目前韩国政府预计2025年官民对该领域投资达到94万亿韩元。</p><p>　　韩国总统文在寅在报告会上表示，企业是碳中和的主人公，政府支持企业的努力，将成为企业实现碳中和的坚强后盾。同时，政府将通过技术革新将能源价格维持在合理水平，并致力于确保经济安全，从而保障核心能源的稳定供应。</p><p>　　<strong>加快国际合作步伐</strong></p><p>　　由于韩国国内市场狭小，技术应用需要更大的国际市场，同时在碳中和时代实现材料自给等目标需要关键矿产，自韩国政府公布碳中和远景目标以来，韩国产业通商资源部作为相关政策的具体执行部门，积极开展与美国、澳大利亚等国的相关合作。</p><p>　　韩美合作方面，韩国产业通商资源部长官文胜煜于11月在华盛顿会见美国能源部部长詹妮弗·格兰霍姆，决定升级双方已构建的“韩美能源政策对话”，将现有的局长级沟通渠道升级为部长级对话。韩美能源政策对话将分政策、技术、商用化三个部门，为两国脱碳化进程提供支援。通过此次韩美两国能源领域高层官员的互动，韩美双方决定：一是2022年初在韩国举行第一次部长级韩美能源政策对话，积极就碳中和深度合作进行研讨；二是由美国能源部和韩国产业通商资源部主导，在美国国家研究机构设立“韩美网络合作中心”，持续促进技术创新合作的专业人才交流；三是美方将支持韩方提出的“清洁氢能供应链倡议”；四是美国能源部将支持韩企在美国境内运输部门和电力部门推进的氢能相关实证项目。</p><p>　　韩澳合作方面，如文初提到，韩澳首脑于12月中旬会面，一方面确定了两国扩大关键矿产贸易、投资等加强供应链合作的内容；另一方面两国指定氢能供应链，碳捕集、利用与封存，低碳炼钢为2022年重点合作项目，并定于2022年初召开韩澳“碳中和技术运行小组”首次会议和企业间商务圆桌会议，继续就扩大碳中和相关核心技术合作进行商讨。</p>
</div>`,
          },
          {
            id: 1,
            img: 'https://qucs.oss-cn-hangzhou.aliyuncs.com/images/2.jpg',
            title: '坚持全国一盘棋找出碳达峰碳中和的科技最优解',
            content: `<div class=""detil-new-cont"" id=""content"">
<p>　　“表面看，碳达峰碳中和与能源有关系，我国的能源结构不理想，但由于能源跟国民经济的各个行业都有关系，所以碳达峰碳中和是一个综合性的跨行业、跨领域的事情，是国家层面的涉及各个方面的大事情。”9月26日，在2021中关村论坛碳达峰碳中和科技论坛上，中国工程院院士刘中民说道。</p><p>　　碳中和是2021中关村论坛的核心议题之一。碳达峰碳中和科技论坛聚焦碳中和科技创新路径，旨在理清双碳目标下我国未来经济社会发展需求和科技路线布局，实现跨领域综合交叉，突破技术瓶颈。论坛上多位院士专家从科学技术、产业转型出发，结合具体国情为双碳目标建言献策。</p><p style=""text-align: center;""><img src=""/upload/img/251348b9-9edf-400b-964d-300b5a872162.jpg?x-oss-process=style/kepu"" style=""max-width: 500px;""/></p><p style=""text-align: center;""><span style=""font-size: 14px;"">9月25日，参观者在中关村论坛展览（科博会）现场体验一款可用于冬奥场馆交通运营的智慧系统。新华社记者 鞠焕宗摄</span></p><p><strong>　　碳达峰碳中和要发挥科技创新的支撑作用</strong></p><p>　　在论坛致辞中，中国科学院院长、党组书记侯建国指出，实现双碳目标需要经济社会发展的全面绿色转型，涉及能源结构、工业交通、生态建设等各领域，迫切需要发挥科技创新在其中的引领和支撑作用。</p><p>　　刘中民也持有类似的看法。“我们要坚持全国一盘棋，调动各方面积极性，打破行业壁垒来实现碳达峰碳中和。科技创新对实现碳达峰碳中和至关重要。”刘中民说，没有科技创新，碳达峰碳中和很难实现，必须要有新技术来支撑碳达峰碳中和。</p><p>　　“碳达峰碳中和，对我们国家确实是一个极大的挑战。”刘中民坦言。但是，挑战里也有机遇。实现碳达峰、碳中和，是我国新一轮产业结构升级的机会。</p><p>　　“如果我们抓住机遇，把我国的能源结构和工业结构调整到位，我相信我们将比西方发达国家的工业结构更先进更合理。”刘中民强调。</p><p>　　因此，侯建国强调，要拿出一张路线图，解决碳达峰碳中和的实现路径问题；提出一批新理论，突破降碳固碳的原理问题；攻克一批新技术，解决减排增汇的工艺和装备问题；记好一本收支账，解决碳源碳汇的监测核算问题。</p><p>　　在刘中民看来，在实现碳中和、碳达峰的过程中，必须重视一些具有战略意义的新技术发展，比如人工智能、信息技术和数字技术等。</p><p>　　同时，刘中民认为，我国需要大力发展储能和氢能技术。“发展储能平台，以汇聚不稳定的可再生电能，如果能够建立起国家级的储能平台，让可再生电能平稳地进入国家电网系统，这将在很大程度上帮助可再生能源的发展。”刘中民说，我国也需要发展产氢和用氢的氢能平台，氢与能源产业链上游产生二氧化碳的环节进行耦合，可以实现碳减排；直接与二氧化碳反应，可以生产能源产品或载能产品。</p><p><strong>　　“一盘棋式”组织全国研发力量</strong></p><p>　　在主旨报告中，中科院院士丁仲礼指出，碳中和目标对科技界提出了新考验。实现碳中和，要从能源生产、能源消费和固碳“三端发力”，“技术为王”是鲜明特征；要从“引进、吸收、再创新”的传统创新模式向原始创新、颠覆性创新转变，勇于针对未来需求，主动开展有较高失败风险的探索。</p><p>　　丁仲礼表示，要“一盘棋式”组织全国研发力量，建立技术联盟，明确责任体系，开展技术攻关，支撑产业先进性，形成强大的国家竞争力。同时，要与乡村振兴、美丽中国等国家战略相结合，通过生态建设提升我国固碳能力；要深入研究碳排放相关的核心科学问题，争取“固碳量”和“碳中和”的话语权；要关注并算清全球以及各国的“收支账”，为我国在全球气候变化的国际合作和谈判提供有力支撑。</p><p>　　中国科学技术协会党组书记、分管日常工作副主席、书记处第一书记张玉卓在致辞中指出，在碳达峰碳中和进程中，工业转型是关键，需要实现能源和产业结构系统性变革。一是要有序减碳，确定碳排放的顶点和峰值，从国家层面研究能源结构；二是要大力发展CCUS技术，促进二氧化碳的资源化利用；三是树立全民低碳意识，汇聚建设美丽中国的强大合力；四是要推进全球气候治理科技合作，主动参与制定国际标准，发起国际科技合作，共促世界可持续繁荣。</p><p>　　论坛上，中国工程院院士杜祥琬从构建以新能源为主体的新型电力系统的角度，为碳达峰碳中和出谋划策。</p><p>　　杜祥琬认为，构建以新能源为主体的新型电力系统是完全可能的。“概括起来说，纵向的发、输、配、用和源、网、荷、储协调规划，横向多能互补，发展多种类型的商业化的储能技术，调动各种灵活性资源，建设新能源为主体的新型电力系统是完全可能的。”杜祥琬说，它的目的在于安全、可靠、灵活的供电，在极端情况下，包括极端天气情况下，要保证供电的安全，在常态下确保我们经济社会的正常运行。</p><p><!--/enpcontent--></p><p><br/></p>
</div>
`,
          },
          {
            id: 2,
            img: 'https://qucs.oss-cn-hangzhou.aliyuncs.com/images/3.jpg',
            title: '人难免天生有自怜情绪，唯有时刻保持清醒，才能看清真正的价值在哪里3。',
            content: '人难免天生有自怜情绪，唯有时刻保持清醒，才能看清真正的价值在哪里。',
          },
          {
            id: 3,
            img: 'https://qucs.oss-cn-hangzhou.aliyuncs.com/images/4.jpg',
            title: '人难免天生有自怜情绪，唯有时刻保持清醒，才能看清真正的价值在哪里4。',
            content: '人难免天生有自怜情绪，唯有时刻保持清醒，才能看清真正的价值在哪里。',
          },
        ],
      }
    },
    methods: {
      // 跳转到详情节面
      goDetail(item) {
        this.$router.push({ path: '/detail', query: { data: item } })
      },
    },
  }
</script>

<style scoped lang="less">
  /*------------------------------轮播图样式------------------------------*/
  .carousels {
    width: 100%;
    height: 120px;
    overflow: hidden;
    border-radius: 3px;
    box-shadow: 2px 2px 6px #dbd9e9;
    .medium {
      width: 100%;
      height: 100%;
      cursor: pointer;
      transition: all 0.6s;
      &:hover {
        transform: scale(1.3);
      }
    }
  }

  /deep/.el-carousel__container {
    position: relative;
    height: 120px;
  }

  /deep/.el-carousel__item {
    height: 120px;
    overflow: hidden;
  }

  /deep/.el-carousel__button {
    display: block;
    position: absolute;
    bottom: 6px;
    opacity: 0.48;
    width: 2px;
    height: 2px;
    border-radius: 2px;
    background-color: #09e293;
  }

  /deep/.el-carousel__arrow {
    width: 0;
    height: 0;
  }
  /deep/.el-icon-arrow-left,
  /deep/.el-icon-arrow-right {
    font-size: 7px;
    font-weight: 600px;
    color: #09e293;
  }
</style>
