<template>
  <div id="detail">
    <el-backtop>
      <i class="el-icon-caret-top"></i>
    </el-backtop>
    <div class="title">什么是碳中和</div>
    <WordCloud class="wordCloud"></WordCloud>
    <article class="article" v-html="html"></article>
  </div>
</template>

<script>
  import WordCloud from '@/echarts/WordCloud'
  export default {
    name: '',
    components: {
      WordCloud,
    },
    data() {
      return {
        html: '',
      }
    },
    methods: {
      // 获取html文档
      getHtml() {
        this.html = `碳中和是什么？和普通人到底有什么关系 |

自从国家提出要在2060年实现碳中和后，这个词迅速由一个陌生的术语变成了热词。什么是碳中和？碳中和意味着什么？我们为什么要实现碳中和？世界上是否有国家已经实现碳中和？如何实现碳中和？其中有什么机遇又会面临哪些挑战？作为普通的个人，我们能够做点什么？

在接下来的回答中，我们会对上述问题进行详细的解释。

碳中和意味着什么？

18世纪中期以前，地球上的碳循环可能处于大体平衡的状态—植物等吸收的CO2量与全球排放到大气中的CO2量基本相当。18世纪中期以来，我们开始燃烧化石燃料。这些化石燃料是由储藏在地下的碳构成的，主要来自远古时代死去的植物，经过数百年的压缩演化，变成了石油、煤等。我们燃烧这些燃料时，排放了额外的碳，增加了大气中的碳总量。

碳中和指的是温室气体的净零排放。温室气体中最主要也最广为人知的是CO2，这也是“碳中和”一词中“碳”这个字的来历。但温室气体远不止CO2，其它常见温室气体还有甲烷CH4（温室效应为CO2的28倍）、N2O（笑气，温室效应为CO2的265倍）和氟化气体（常用制冷剂，温室效应为CO2的万倍以上）。

中和就是净零排放。净零排放不是零排放，地球可能永远也做不到温室气体零排放。没有人类活动，自然界也会产生温室气体，毕竟牛打个嗝都会释放甲烷。净零排放是指保持大气中的温室气体量基本稳定，新排放出来多少温室气体，就要通过各种方式消除等当量的温室气体，最后的结果是大气中温室气体增量为0。

为什么要实现碳中和？\n
碳中和是什么？和普通人到底有什么关系 |

自从国家提出要在2060年实现碳中和后，这个词迅速由一个陌生的术语变成了热词。什么是碳中和？碳中和意味着什么？我们为什么要实现碳中和？世界上是否有国家已经实现碳中和？如何实现碳中和？其中有什么机遇又会面临哪些挑战？作为普通的个人，我们能够做点什么？

在接下来的回答中，我们会对上述问题进行详细的解释。

碳中和意味着什么？

18世纪中期以前，地球上的碳循环可能处于大体平衡的状态—植物等吸收的CO2量与全球排放到大气中的CO2量基本相当。18世纪中期以来，我们开始燃烧化石燃料。这些化石燃料是由储藏在地下的碳构成的，主要来自远古时代死去的植物，经过数百年的压缩演化，变成了石油、煤等。我们燃烧这些燃料时，排放了额外的碳，增加了大气中的碳总量。

碳中和指的是温室气体的净零排放。温室气体中最主要也最广为人知的是CO2，这也是“碳中和”一词中“碳”这个字的来历。但温室气体远不止CO2，其它常见温室气体还有甲烷CH4（温室效应为CO2的28倍）、N2O（笑气，温室效应为CO2的265倍）和氟化气体（常用制冷剂，温室效应为CO2的万倍以上）。

中和就是净零排放。净零排放不是零排放，地球可能永远也做不到温室气体零排放。没有人类活动，自然界也会产生温室气体，毕竟牛打个嗝都会释放甲烷。净零排放是指保持大气中的温室气体量基本稳定，新排放出来多少温室气体，就要通过各种方式消除等当量的温室气体，最后的结果是大气中温室气体增量为0。

为什么要实现碳中和？\n
碳中和是什么？和普通人到底有什么关系 |

自从国家提出要在2060年实现碳中和后，这个词迅速由一个陌生的术语变成了热词。什么是碳中和？碳中和意味着什么？我们为什么要实现碳中和？世界上是否有国家已经实现碳中和？如何实现碳中和？其中有什么机遇又会面临哪些挑战？作为普通的个人，我们能够做点什么？

在接下来的回答中，我们会对上述问题进行详细的解释。

碳中和意味着什么？\n

18世纪中期以前，地球上的碳循环可能处于大体平衡的状态—植物等吸收的CO2量与全球排放到大气中的CO2量基本相当。18世纪中期以来，我们开始燃烧化石燃料。这些化石燃料是由储藏在地下的碳构成的，主要来自远古时代死去的植物，经过数百年的压缩演化，变成了石油、煤等。我们燃烧这些燃料时，排放了额外的碳，增加了大气中的碳总量。

碳中和指的是温室气体的净零排放。温室气体中最主要也最广为人知的是CO2，这也是“碳中和”一词中“碳”这个字的来历。但温室气体远不止CO2，其它常见温室气体还有甲烷CH4（温室效应为CO2的28倍）、N2O（笑气，温室效应为CO2的265倍）和氟化气体（常用制冷剂，温室效应为CO2的万倍以上）。

中和就是净零排放。净零排放不是零排放，地球可能永远也做不到温室气体零排放。没有人类活动，自然界也会产生温室气体，毕竟牛打个嗝都会释放甲烷。净零排放是指保持大气中的温室气体量基本稳定，新排放出来多少温室气体，就要通过各种方式消除等当量的温室气体，最后的结果是大气中温室气体增量为0。

为什么要实现碳中和？`
      },
    },
    // 获取数据
    created() {
      this.getHtml()
    },
  }
</script>

<style scoped lang="less">
  #detail {
    width: 100%;
    background-color: #f7f8f9;
    overflow-x: hidden;
    .title {
      display: flex;
      justify-content: center;
      align-items: center;
      font-size: 15px;
      color: #fff;
      font-weight: 600;
      height: 53px;
      background-image: url('https://qucs.oss-cn-hangzhou.aliyuncs.com/images/9.jpg');
      background-repeat: no-repeat;
      background-size: cover;
    }
    .article {
      padding: 0 30px;
      font-size: 5.3px;
      z-index: 100;
      text-indent: 2em;
      line-clamp: 2;
      text-align: justify;
    }
    .el-backtop {
      width: 10px !important;
      height: 10px !important;
      font-size: 2px !important;
    }
    .el-icon-caret-top {
      font-size: 8px;
      color: #0dbc79;
    }
  }
</style>
